void main() {
  // пример 1

  int a = 6;
  if (a>5) {

    print("число больше 5");

  } else {
    print('Число меншье 5');
  }



  // пример 2
  // int a = 6;
  // if (a>5) {

  //   print("число больше 5");
  // } else if (a<5) { 
  //   print("Число меншье 5");
  // } else {
  //   print('Число равно 5');
  // }
    
 //  != означае не равно


  // пример 3
  // int a=5;
  // if (a!=5) {
  //   print('число не равно 5');

  // } else {
  //   print('число равно 5');
  // }

  // пример 4
   int b =4;
    if (b>5 && a < 10) {
      print('10');
    } else {
      print('Error');
    }


  // пример 5
  
 
 

  
  
}